fio/log/ext4_3rd_random_write_log.txt
fio_test: (g=0): rw=randwrite, bs=4096B-4096B,4096B-4096B,4096B-4096B, ioengine=libaio, iodepth=128
...
fio-2.16-35-g8c4e
Starting 8 threads

fio_test: (groupid=0, jobs=1): err= 0: pid=4427: Thu Jan 19 07:16:27 2017
  write: IOPS=6150, BW=24.3MiB/s (25.2MB/s)(800GiB/34095493msec), iops=6150, runt=
    slat (usec): min=1, max=40812, avg= 5.78, stdev=72.92
    clat (usec): min=651, max=129965, avg=20803.52, stdev=12394.35
     lat (usec): min=663, max=129967, avg=20809.30, stdev=12394.20
    clat percentiles (usec):
     |  1.00th=[ 3504],  5.00th=[ 9280], 10.00th=[10560], 20.00th=[11072],
     | 30.00th=[11712], 40.00th=[12608], 50.00th=[14272], 60.00th=[19328],
     | 70.00th=[26496], 80.00th=[33024], 90.00th=[40704], 95.00th=[45312],
     | 99.00th=[51456], 99.50th=[55552], 99.90th=[67072], 99.95th=[71168],
     | 99.99th=[81408]
    lat (usec) : 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=1.64%, 10=4.43%, 20=54.57%, 50=37.92%
    lat (msec) : 100=1.44%, 250=0.01%
  cpu          : usr=1.17%, sys=4.14%, ctx=55975875, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=0,209715200,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128
fio_test: (groupid=0, jobs=1): err= 0: pid=4428: Thu Jan 19 07:16:27 2017
  write: IOPS=6149, BW=24.3MiB/s (25.2MB/s)(800GiB/34101626msec), iops=6149, runt=
    slat (usec): min=1, max=40738, avg= 5.80, stdev=73.01
    clat (usec): min=302, max=128614, avg=20807.25, stdev=12398.36
     lat (usec): min=304, max=128623, avg=20813.05, stdev=12398.20
    clat percentiles (usec):
     |  1.00th=[ 3504],  5.00th=[ 9280], 10.00th=[10560], 20.00th=[11072],
     | 30.00th=[11712], 40.00th=[12608], 50.00th=[14272], 60.00th=[19328],
     | 70.00th=[26752], 80.00th=[33024], 90.00th=[40704], 95.00th=[45312],
     | 99.00th=[51456], 99.50th=[55552], 99.90th=[67072], 99.95th=[71168],
     | 99.99th=[82432]
    lat (usec) : 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=1.67%, 10=4.43%, 20=54.50%, 50=37.96%
    lat (msec) : 100=1.44%, 250=0.01%
  cpu          : usr=1.17%, sys=4.15%, ctx=55984660, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=0,209715200,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128
fio_test: (groupid=0, jobs=1): err= 0: pid=4429: Thu Jan 19 07:16:27 2017
  write: IOPS=6150, BW=24.3MiB/s (25.2MB/s)(800GiB/34097984msec), iops=6150, runt=
    slat (usec): min=1, max=40729, avg= 5.78, stdev=72.70
    clat (usec): min=405, max=137457, avg=20805.05, stdev=12390.93
     lat (usec): min=407, max=137462, avg=20810.82, stdev=12390.77
    clat percentiles (usec):
     |  1.00th=[ 3504],  5.00th=[ 9280], 10.00th=[10560], 20.00th=[11072],
     | 30.00th=[11712], 40.00th=[12608], 50.00th=[14272], 60.00th=[19328],
     | 70.00th=[26496], 80.00th=[33024], 90.00th=[40704], 95.00th=[45312],
     | 99.00th=[51456], 99.50th=[55552], 99.90th=[67072], 99.95th=[71168],
     | 99.99th=[81408]
    lat (usec) : 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=1.63%, 10=4.42%, 20=54.56%, 50=37.94%
    lat (msec) : 100=1.44%, 250=0.01%
  cpu          : usr=1.17%, sys=4.14%, ctx=55991489, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=0,209715200,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128
fio_test: (groupid=0, jobs=1): err= 0: pid=4430: Thu Jan 19 07:16:27 2017
  write: IOPS=6151, BW=24.3MiB/s (25.2MB/s)(800GiB/34093153msec), iops=6151, runt=
    slat (usec): min=1, max=40894, avg= 5.77, stdev=72.96
    clat (usec): min=579, max=128993, avg=20802.09, stdev=12398.12
     lat (usec): min=582, max=128996, avg=20807.86, stdev=12397.96
    clat percentiles (usec):
     |  1.00th=[ 3504],  5.00th=[ 9280], 10.00th=[10560], 20.00th=[11072],
     | 30.00th=[11712], 40.00th=[12608], 50.00th=[14272], 60.00th=[19328],
     | 70.00th=[26496], 80.00th=[33024], 90.00th=[40704], 95.00th=[45312],
     | 99.00th=[51456], 99.50th=[55552], 99.90th=[67072], 99.95th=[71168],
     | 99.99th=[81408]
    lat (usec) : 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=1.64%, 10=4.45%, 20=54.55%, 50=37.91%
    lat (msec) : 100=1.44%, 250=0.01%
  cpu          : usr=1.18%, sys=4.13%, ctx=55989896, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=0,209715200,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128
fio_test: (groupid=0, jobs=1): err= 0: pid=4431: Thu Jan 19 07:16:27 2017
  write: IOPS=6151, BW=24.3MiB/s (25.2MB/s)(800GiB/34093706msec), iops=6151, runt=
    slat (usec): min=1, max=38634, avg= 5.78, stdev=73.10
    clat (usec): min=371, max=134141, avg=20802.42, stdev=12391.31
     lat (usec): min=379, max=134146, avg=20808.21, stdev=12391.15
    clat percentiles (usec):
     |  1.00th=[ 3504],  5.00th=[ 9280], 10.00th=[10560], 20.00th=[11072],
     | 30.00th=[11712], 40.00th=[12608], 50.00th=[14272], 60.00th=[19328],
     | 70.00th=[26496], 80.00th=[33024], 90.00th=[40704], 95.00th=[45312],
     | 99.00th=[51456], 99.50th=[55552], 99.90th=[67072], 99.95th=[71168],
     | 99.99th=[81408]
    lat (usec) : 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=1.64%, 10=4.43%, 20=54.54%, 50=37.94%
    lat (msec) : 100=1.43%, 250=0.01%
  cpu          : usr=1.17%, sys=4.14%, ctx=56000910, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=0,209715200,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128
fio_test: (groupid=0, jobs=1): err= 0: pid=4432: Thu Jan 19 07:16:27 2017
  write: IOPS=6149, BW=24.3MiB/s (25.2MB/s)(800GiB/34100466msec), iops=6149, runt=
    slat (usec): min=1, max=40729, avg= 5.77, stdev=72.90
    clat (usec): min=530, max=134762, avg=20806.56, stdev=12404.35
     lat (usec): min=533, max=134765, avg=20812.33, stdev=12404.19
    clat percentiles (usec):
     |  1.00th=[ 3504],  5.00th=[ 9280], 10.00th=[10560], 20.00th=[11072],
     | 30.00th=[11712], 40.00th=[12608], 50.00th=[14272], 60.00th=[19328],
     | 70.00th=[26752], 80.00th=[33024], 90.00th=[40704], 95.00th=[45312],
     | 99.00th=[51456], 99.50th=[55552], 99.90th=[67072], 99.95th=[71168],
     | 99.99th=[81408]
    lat (usec) : 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=1.64%, 10=4.45%, 20=54.56%, 50=37.90%
    lat (msec) : 100=1.45%, 250=0.01%
  cpu          : usr=1.18%, sys=4.13%, ctx=55983193, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=0,209715200,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128
fio_test: (groupid=0, jobs=1): err= 0: pid=4433: Thu Jan 19 07:16:27 2017
  write: IOPS=6149, BW=24.3MiB/s (25.2MB/s)(800GiB/34100071msec), iops=6149, runt=
    slat (usec): min=1, max=38335, avg= 5.80, stdev=73.07
    clat (usec): min=373, max=129074, avg=20806.29, stdev=12400.25
     lat (usec): min=380, max=129076, avg=20812.10, stdev=12400.09
    clat percentiles (usec):
     |  1.00th=[ 3504],  5.00th=[ 9280], 10.00th=[10560], 20.00th=[11072],
     | 30.00th=[11712], 40.00th=[12608], 50.00th=[14272], 60.00th=[19328],
     | 70.00th=[26752], 80.00th=[33024], 90.00th=[40704], 95.00th=[45312],
     | 99.00th=[51456], 99.50th=[55552], 99.90th=[67072], 99.95th=[71168],
     | 99.99th=[81408]
    lat (usec) : 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=1.65%, 10=4.43%, 20=54.57%, 50=37.91%
    lat (msec) : 100=1.44%, 250=0.01%
  cpu          : usr=1.17%, sys=4.15%, ctx=55933529, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=0,209715200,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128
fio_test: (groupid=0, jobs=1): err= 0: pid=4434: Thu Jan 19 07:16:27 2017
  write: IOPS=6150, BW=24.3MiB/s (25.2MB/s)(800GiB/34099511msec), iops=6150, runt=
    slat (usec): min=1, max=39522, avg= 5.78, stdev=72.84
    clat (usec): min=518, max=125788, avg=20805.98, stdev=12399.67
     lat (usec): min=520, max=125790, avg=20811.76, stdev=12399.51
    clat percentiles (usec):
     |  1.00th=[ 3504],  5.00th=[ 9280], 10.00th=[10560], 20.00th=[11072],
     | 30.00th=[11712], 40.00th=[12608], 50.00th=[14272], 60.00th=[19328],
     | 70.00th=[26752], 80.00th=[33024], 90.00th=[40704], 95.00th=[45312],
     | 99.00th=[51456], 99.50th=[55552], 99.90th=[67072], 99.95th=[71168],
     | 99.99th=[82432]
    lat (usec) : 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=1.65%, 10=4.44%, 20=54.54%, 50=37.93%
    lat (msec) : 100=1.44%, 250=0.01%
  cpu          : usr=1.17%, sys=4.14%, ctx=56006589, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=0,209715200,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=192MiB/s (202MB/s), 24.3MiB/s-24.3MiB/s (25.2MB/s-25.2MB/s), io=6400GiB (6872GB), run=34093153-34101626msec

Disk stats (read/write):
  nvme0n1: ios=2/1677730408, merge=0/6818, ticks=5/461684044, in_queue=1058473696, util=100.00%